IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

PROCEDURE DIVISION.
    DISPLAY "Hello,world".
    STOP RUN.
  
  IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR1    PIC A(3) VALUE "ABC".

       PROCEDURE DIVISION.
           DISPLAY "100".
           DISPLAY VAR1.
           STOP RUN.