       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATA-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STUDENT-NAME     PIC A(20) VALUE "NITHIN SHASHANK".
       01  STUDENT-AGE      PIC 99     VALUE 25.
       01  COURSE           PIC X(15)  VALUE "COBOL PROGRAMMING".

       PROCEDURE DIVISION.
           DISPLAY "STUDENT NAME : " STUDENT-NAME.
           DISPLAY "AGE          : " STUDENT-AGE.
           DISPLAY "COURSE       : " COURSE.
           STOP RUN.
