       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  USER-NAME    PIC A(20) VALUE "NITHIN".

       PROCEDURE DIVISION.
           DISPLAY "TABLE".
           DISPLAY "WELCOME " USER-NAME.
           STOP RUN.
