       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROC-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1     PIC 9(3) VALUE 10.
       01  NUM2     PIC 9(3) VALUE 20.
       01  RESULT   PIC 9(4).

       PROCEDURE DIVISION.
           DISPLAY "=== PROCEDURE DIVISION EXAMPLE ===".
           
           ADD NUM1 TO NUM2 GIVING RESULT.
           DISPLAY "THE SUM OF " NUM1 " AND " NUM2 " IS " RESULT.

           SUBTRACT NUM1 FROM NUM2 GIVING RESULT.
           DISPLAY "THE DIFFERENCE OF " NUM2 " AND " NUM1 " IS " RESULT.

           MULTIPLY NUM1 BY NUM2 GIVING RESULT.
           DISPLAY "THE PRODUCT OF " NUM1 " AND frdtvsdh " NUM2 " IS "
            RESULT.

           DIVIDE NUM2 BY NUM1 GIVING RESULT.
           DISPLAY "THE QUOTIENT OF " NUM2 " DIVIDED BY " NUM1 " IS "
            RESULT.

           STOP RUN.
