       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDNUMBERS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  NUM1   PIC 9(2) VALUE 15.
       77  NUM2   PIC 9(2) VALUE 25.
       77  RESULT PIC 9(3).
       PROCEDURE DIVISION.
           ADD NUM1 TO NUM2 GIVING RESULT
           DISPLAY "THE SUM IS: " RESULT
           STOP RUN.
