IDENTIFICATION DIVISION.
PROGRAM-ID. SUB.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUM1        PIC 9(5) VALUE ZEROS.
01  NUM2        PIC 9(5) VALUE ZEROS.
01  RESULT      PIC S9(6) VALUE ZEROS.

PROCEDURE DIVISION.
DISPLAY "Enter first number: ".
ACCEPT NUM1.
DISPLAY "Enter second number: ".
ACCEPT NUM2.

SUBTRACT NUM2 FROM NUM1 GIVING RESULT.

DISPLAY "Result of subtraction: " RESULT.

STOP RUN.