       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FIRST-NAME   PIC X(10) VALUE "NITHIN".
       01  LAST-NAME    PIC X(10) VALUE "SHASHANK".
       01  FULL-NAME    PIC X(25).

       PROCEDURE DIVISION.
           STRING FIRST-NAME DELIMITED BY SPACE
                  " " DELIMITED BY SIZE
                  LAST-NAME DELIMITED BY SPACE
                  INTO FULL-NAME
           END-STRING.

           DISPLAY "FULL NAME IS: " FULL-NAME.
           STOP RUN.
