IDENTIFICATION DIVISION.
PROGRAM-ID. AdditionExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 50.
01 NUM2 PIC 9(3) VALUE 25.
01 RESULT PIC 9(4).

PROCEDURE DIVISION.
    ADD NUM1 TO NUM2 GIVING RESULT.
    DISPLAY "Result = " RESULT.
    STOP RUN.