IDENTIFICATION DIVISION.
PROGRAM-ID. MathExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A       PIC 9(3) VALUE 20.
01 B       PIC 9(3) VALUE 4.
01 RESULT1 PIC 9(4).
01 RESULT2 PIC 9(4).

PROCEDURE DIVISION.
    MULTIPLY A BY B GIVING RESULT1.
    DISPLAY "Multiplication = " RESULT1.

    DIVIDE A BY B GIVING RESULT2.
    DISPLAY "Division = " RESULT2.

    STOP RUN.
