IDENTIFICATION DIVISION.
PROGRAM-ID. StringExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-NAME     PIC X(10) VALUE "NITHIN".
01 LAST-NAME      PIC X(10) VALUE "SHASHANK".
01 FULL-NAME      PIC X(25).

PROCEDURE DIVISION.
    STRING FIRST-NAME DELIMITED BY SPACE
           " "
           LAST-NAME DELIMITED BY SPACE
           INTO FULL-NAME
    END-STRING.

    DISPLAY "Full Name: " FULL-NAME.
    STOP RUN.
