       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLASS-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  VALUE1  PIC X(5) VALUE "12345".
       01  VALUE2  PIC X(5) VALUE "HELLO".

       PROCEDURE DIVISION.
           IF VALUE1 IS NUMERIC
               DISPLAY "VALUE1 IS NUMERIC".
           IF VALUE2 IS ALPHABETIC
               DISPLAY "VALUE2 IS ALPHABETIC".
           STOP RUN.
