identification division.
program-id - table.
data division.
working storage section.
01 num pic 9(5).
01 num pic 9(5).
01 result pic 9(5).
procedure division.
display "455".
move 455 to num
stop run.