       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIGN-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM  PIC S9(4) VALUE -15.

       PROCEDURE DIVISION.
           IF NUM IS NEGATIVE
               DISPLAY "NUMBER IS NEGATIVE".
           IF NUM IS POSITIVE
               DISPLAY "NUMBER IS POSITIVE".
           IF NUM IS ZERO
               DISPLAY "NUMBER IS ZERO".
           STOP RUN.
